Reikimen/ESP-IDF-TEST/esp32_http_pcm_record/sdkconfig.defaults
# ESP32S3 specific
CONFIG_IDF_TARGET="esp32s3"

# Flash Configuration - ESP32-S3-WROOM-1-N16R8 has 16MB Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=y

# PSRAM Configuration - 启用PSRAM支持
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE=-1

# PSRAM 使用策略 - 允许通过heap_caps_malloc分配
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MEMTEST=y

# PSRAM 速度配置 - 使用80MHz以保证稳定性
CONFIG_SPIRAM_SPEED_80M=y

# 允许BSS段在PSRAM中（可选，用于大型静态数组）
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=n

# Cache配置
CONFIG_SPIRAM_CACHE_WORKAROUND=y

# Partition Table Configuration
# 使用自定义分区表以充分利用16MB Flash
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=0
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=6
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=6

# HTTP Client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# Increase main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Enable JSON library
CONFIG_JSMN=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Enable I2S driver
CONFIG_DRIVER_I2S_ENABLE=y

# Enable I2C driver
CONFIG_DRIVER_I2C_ENABLE=y

# Set log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y